<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class TeacherSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $teachers = [
            [
                'name' => 'Якубов Лочинбек Бахтиярович',
                'desc' => '
                Лавозим: Директор
                Туғилган йили: 01.03.1984 й
                Телефон рақами: 97 363 44 02
                ',
            ],
            [
                'name' => 'Эркинов Қудрат Тўлқинович',
                'desc' => '
                Лавозим: ЎИБДЎ
                Туғилган йили: 03.07.1993 й
                Телефон рақами: 94 429 69 19
                ',
            ],
            [
                'name' => 'Қурёзов Бекзод Қурёзович ',
                'desc' => '
                Лавозим: ММваТИБДЎ
                Туғилган йили: 27.11.1983 й
                Телефон рақами: 91 426 77 94
                ',
            ],
            [
                'name' => 'Бобожонов Дилмурод Жаббарганович',
                'desc' => '
                Лавозим: МваХТБДЎ
                Туғилган йили: 10.02.1988 й
                Телефон рақами: 93 266 22 88
                ',
            ],
            [
                'name' => 'Артиков Сурожбек Шоназарович',
                'desc' => '
                Лавозим: Курс командири
                Туғилган йили: 17.06.1997 й
                Телефон рақами: 97 091 00 17
                ',
            ],
            [
                'name' => 'Машарипов Анвар Маримбаевич',
                'desc' => '
                Лавозим: Курс командири
                Туғилган йили: 17.07.1988 й
                Телефон рақами: 88 969 88 11
                ',
            ],
            [
                'name' => 'Абдуллаев Мадамин Саотбоевич',
                'desc' => '
                Лавозим: Кафедра бошлиғи
                Туғилган йили: 16.03.1972 й
                Телефон рақами: 93 465 08 32
                ',
            ],
            [
                'name' => 'Исмоилова Ҳимоят Матназаровна ',
                'desc' => '
                Лавозим: Кафедра бошлиғи
                Туғилган йили: 12.12.1984 й
                Телефон рақами: 94 230 08 46
                ',
            ],
            [
                'name' => 'Рахимова Сулурхан Джуманиязовна',
                'desc' => '
                Лавозим: Кафедра бошлиғи
                Туғилган йили: 20.05.1975 й
                Телефон рақами: 90 438 16 58
                ',
            ],
            [
                'name' => 'Қўзиева Юлдуз Сапарбоевна',
                'desc' => '
                Лавозим: Ўқув бўлим мудири
                Туғилган йили: 09.11.1977 й
                Телефон рақами: 97 723 09 18
                ',
            ],
            [
                'name' => 'Сапаева Садоқат Одилбековна',
                'desc' => '
                Лавозим: Ўқув бўлим услубчиси
                Туғилган йили: 24.05.1989 й
                Телефон рақами: 97 510 68 86
                ',
            ],
            [
                'name' => 'Болтаев Рустам Янгибаевич',
                'desc' => '
                Лавозим: Ёшлар етакчиси
                Туғилган йили: 22.10.1989 й
                Телефон рақами: 97 791 53 52
                ',
            ],
            [
                'name' => 'Худойберганова Шарофат Эргашевна',
                'desc' => '
                Лавозим: Она тили ва адабиёт фани ўқитувчиси
                Туғилган йили: 05.07.1980 й
                Телефон рақами: 99 969 20 44
                ',
            ],
            [
                'name' => 'Джуманиязова Наргиза Бахтиёровна',
                'desc' => '
                Лавозим: Она тили ва адабиёт фани ўқитувчиси
                Туғилган йили: 05.10.1988 й
                Телефон рақами: 99 949 09 36
                ',
            ],
            [
                'name' => 'Худайберганова Роза Джумадурдиевна',
                'desc' => '
                Лавозим: Рус тили фани ўқитувчиси
                Туғилган йили: 27.12.1967 й
                Телефон рақами: 90 648 76 46
                ',
            ],
            [
                'name' => 'Бегимов Максуд Хиясович',
                'desc' => '
                Лавозим: Рус тили фани ўқитувчиси
                Туғилган йили: 26.07.1960 й
                Телефон рақами: 99 501 60 51
                ',
            ],
            [
                'name' => 'Юсупова Рахима Ахмедовна (Декрет)',
                'desc' => '
                Лавозим: Инглиз тили  фани  ўқитувчиси
                Туғилган йили: 27.11.1989 й
                Телефон рақами: 97 452 53 35
                ',
            ],
            [
                'name' => 'Матниязова Насиба Самандаровна',
                'desc' => '
                Лавозим: Инглиз тили фани  ўқитувчиси
                Туғилган йили: 07.10.1987 й
                Телефон рақами: 99 150 07 88
                ',
            ],
            [
                'name' => 'Бабажанова Икбол Саломаддиновна',
                'desc' => '
                Лавозим: Инглиз тили фани  ўқитувчиси
                Туғилган йили: 24.02.1987 й
                Телефон рақами: 99 664 56 86
                ',
            ],
            [
                'name' => 'Авезова Шаҳло Давранбоевна',
                'desc' => '
                Лавозим: Инглиз тили  фани ўқитувчиси
                Туғилган йили: 12.11.1988 й
                Телефон рақами: 99 504 54 04
                ',
            ],
            [
                'name' => 'Юлдашева Феруза  Боходировна ',
                'desc' => '
                Лавозим: Инглиз тили фани ўқитувчиси
                Туғилган йили: 13.10.1983 й
                Телефон рақами: 99 058 75 55
                ',
            ],
            [
                'name' => 'Машарипова Малоҳат Давлатбоевна',
                'desc' => '
                Лавозим: Инглиз тили фани ўқитувчиси
                Туғилган йили: 30.08.1986 й
                Телефон рақами: 99 243 77 36
                ',
            ],
            [
                'name' => 'Сабирова Нилуфар Шарифбаевна ',
                'desc' => '
                Лавозим: Инглиз тили фани ўқитувчиси
                Туғилган йили: 03.08.1990 й
                Телефон рақами: 97 221 86 90
                ',
            ],
            [
                'name' => 'Шерова Малоҳат Палванназировна',
                'desc' => '
                Лавозим: Француз тили  фани ўқитувчиси
                Туғилган йили: 09.01.1986 й
                Телефон рақами: 97 790 10 67
                ',
            ],
            [
                'name' => 'Жабберганова Нодира Саиджоновна ',
                'desc' => '
                Лавозим: Немис тили фани ўқитувчиси
                Туғилган йили: 13.12.1986 й
                Телефон рақами: 97 364 41 50
                ',
            ],
            [
                'name' => 'Ускинов Самандар Сапарбаевич',
                'desc' => '
                Лавозим: Тарих фани ўқитувчиси
                Туғилган йили: 18.02.1976 й
                Телефон рақами: 97 792 63 67
                ',
            ],
            [
                'name' => 'Матяқубов Элёрбек Амонбоевич',
                'desc' => '
                Лавозим: Тарих фани ўқитувчиси
                Туғилган йили: 12.12.1988 й
                Телефон рақами: 99 525 54 46
                ',
            ],
            [
                'name' => 'Отакова Маҳбуба Алишеровна',
                'desc' => '
                Лавозим: Хуқуқ фани ўқитувчиси
                Туғилган йили: 05.11.1986 й
                Телефон рақами: 97 364 57 09
                ',
            ],
            [
                'name' => 'Рахманов Фахриддин Хударганович',
                'desc' => '
                Лавозим: Хуқуқ фани ўқитувчиси
                Туғилган йили: 07.04.1986 й
                Телефон рақами: 99 667 56 86
                ',
            ],
            [
                'name' => 'Машарипов Зафар Норматович ',
                'desc' => '
                Лавозим: Махсус фан
                Туғилган йили: 19.08.1977 й
                Телефон рақами: 99 965 45 35
                ',
            ],
            [
                'name' => 'Абдуллаев Вахобжон Рузметович ',
                'desc' => '
                Лавозим: Махсус фан
                Туғилган йили: 02.07.1971 й
                Телефон рақами: 99 965 21 73
                ',
            ],
            [
                'name' => 'Ражапова Авазжон Муминжановна',
                'desc' => '
                Лавозим: Информатика
                Туғилган йили: 01.07.1989 й
                Телефон рақами: 99 969 67 47
                ',
            ],
            [
                'name' => 'Рахимова Феруза Атабек-қизи',
                'desc' => '
                Лавозим: Информатика
                Туғилган йили: 19.04.1974 й
                Телефон рақами: 93 285 88 55
                ',
            ],
            [
                'name' => 'Сапаева Аноргул Рахимовна',
                'desc' => '
                Лавозим: Биология фани ўқитувчиси
                Туғилган йили: 01.01.1969 й
                Телефон рақами: 97 511 77 02
                ',
            ],
            [
                'name' => 'Одамбоева Лолахон  Равшан қизи ',
                'desc' => '
                Лавозим: Физика фани ўқитувчиси
                Туғилган йили: 03.11.1992 й
                Телефон рақами: 97 090 09 81
                ',
            ],
            [
                'name' => 'Рузметов Фурқат Икрамович',
                'desc' => '
                Лавозим: Жисмоний тарбия ўқитувчиси
                Туғилган йили: 04.05.1986 й
                Телефон рақами: 97 513 53 04
                ',
            ],
            [
                'name' => 'Разаков Санжар Атахонович',
                'desc' => '
                Лавозим: Жисмоний тарбия ўқитувчиси
                Туғилган йили: 12.10.1985 й
                Телефон рақами: 91 906 50 50
                ',
            ],
            [
                'name' => 'Аширов Рашидбек Азимбоевич',
                'desc' => '
                Лавозим: Ҳарбий чақириқ. тайёр. рахбари
                Туғилган йили: 23.07.1980 й
                Телефон рақами: 91 425 29 63
                ',
            ],
        ];

        foreach ($teachers as $teacher) {
            DB::table('teachers')->insert([
                'name' => $teacher['name'],
                'desc' => $teacher['desc'],
                'img' => 'user.png',
            ]);
        }
    }
}
